#include <stdio.h>

int main()
{
    int a, b, c, d, e;

    printf("Шөл устай хоол идэх үү?\nТийм бол 1 үгүй бол 0 оруулна уу\n");
    scanf("%d", &a);
    if (a == 1)
    {
        printf("Цайтай бол 1 шөлтэй бол 0 оруулна уу \n");
        scanf("%d", &b);
        if (b == 1)
        {
            printf("Будаатай бол 1, үгүй бол 0 оруулна уу \n");
            scanf("%d", &c);
            if (c == 1)
            {
                printf("Будаатай цай");
            }
            else
            {
                printf("Банштай цай");
            }
        }
        else
        {
            printf("Юутай шөл идмээр байна \nГурилтай бол 1\nПүнтүүзтэй бол 2\nГоймонтой бол 3\nБанштай бол 4\nМахтай бол 5\nНогоотой бол 6-г оруулна уу\n");
            scanf("%d", &c);
            switch (c)
            {
            case 1:
                printf("Лапша");
                break;
            case 2:
                printf("Хуйцай");
                break;
            case 3:
                printf("Гоймонтой шөл");
                break;
            case 4:
                printf("Банштай цай");
                break;
            case 5:
                printf("Хар шөл");
                break;
            case 6:
                printf("Ногоотой шөл");
                break;
            }
        }
    }
    else
    {
        printf("Мах нь татсан бол 1 үгүй бол 0 оруулна уу \n");
        scanf("%d", &b);
        if (b == 1)
        {
            printf("Гуриланд ороосон бол 1 үгүй бол 0 оруулна уу\n");
            scanf("%d", &c);
            if (c == 1)
            {
                printf("Яаж болгосон бэ?\n Шарсан бол 1\n Жигнэсэн бол 2 оруулна уу \n");
                scanf("%d", &d);
                if (d == 1)
                {
                    printf("Яаж шарсан бэ?\n Хөөлгөж шарсан бол 1\n Шууд шарсан бол 2 оруулна уу\n");
                    scanf("%d", &e);
                    if (e == 1)
                    {
                        printf("Пирошки");
                    }
                    else
                    {
                        printf("Хуушуур");
                    }
                }
                else
                {
                    printf("Яаж жигнэсэн бэ?\n Хөөлгөн жигнэсэн бол 1\n Шууд жигнэсэн бол 2 оруулна уу\n");
                    scanf("%d", &e);
                    if (e == 1)
                    {
                        printf("Мантуун бууз");
                    }
                    else
                    {
                        printf("Бууз");
                    }
                }
            }
            else
            {
                printf("Будаатай юу?\n Өндгөнд ороосон бол 1\n Махаа бөөрөнхийлсөн бол 2 оруулна уу \n");
                scanf("%d", &d);
                if (d == 1)
                {
                    printf("Өндөгтэй бифштекс");
                }
                else
                {
                    printf("Тефтель");
                }
            }
        }
        else
        {
            printf("Юутай хольсон бэ?\n Гурилтай хольсон бол 1\n Өндөгтэй хольсон бол 2\n Будаатай хольсон бол 3\n Ногоотой хольсон бол 4 оруулна уу\n");
            scanf("%d", &c);
            switch (c)
            {
            case 1:
                printf("Цуйван");
                break;
            case 2:
                printf("Өндөгтэй хуурга");
                break;
            case 3:
                printf("Хооронд нь холих бол 1 үгүй бол 0 оруулна уу \n");
                scanf("%d", &d);
                if (d == 1)
                {
                    printf("Гулиаш");
                }
                else
                {
                    printf("Будаатай хуурга");
                }
                break;
            case 4:
                printf("Ногоотой хуурга");
                break;
            }
        }
    }

    return 0;
}